{
    "Profit Warning": "News or announcements indicating that a company expects lower profits than forecasted, often triggering sharp sell-offs.",
    "Earnings Miss": "Reports that actual earnings fell short of expectations, which typically lead to immediate negative price reactions.",
    "Earnings Report": "Company earnings reports that reveal financial performance and shape investor expectations for future growth.",
    "Downgrade": "Analyst downgrades that signal lower future performance and are strongly linked with declines in stock prices.",
    "Merger": "Announcements of mergers that can spark both optimism and uncertainty, influencing investor sentiment and market dynamics.",
    "Acquisition": "News about acquisitions that may alter growth prospects and shift market expectations about future performance.",
    "Bankruptcy": "Reports of bankruptcy filings or imminent financial distress that send strong negative signals to the market.",
    "Default": "Warnings or occurrences of default by companies or sovereign entities, often leading to heightened volatility.",
    "Executive Resignation": "Sudden departures of key executives that may indicate internal problems and prompt market reassessment.",
    "Leadership Change": "Unexpected changes in top management that can be seen as signs of instability or a strategic shift.",
    "Regulatory Change": "Announcements of new or modified regulations that can impact business costs and overall market forecasts.",
    "Trade War": "News of escalating trade disputes or tariffs that disrupt supply chains and create a risk-off environment.",
    "Sanctions": "Government-imposed restrictions that can affect international trade and corporate profitability.",
    "Brexit": "UK-related economic and trade policy changes that impact global markets and European financial stability.",
    "Election Results": "News on election outcomes that influence economic policies, regulation, and investor sentiment.",
    "Geopolitical Tensions": "Conflicts or diplomatic disputes that increase uncertainty and impact global trade and investments.",
    "Black Swan Event": "Unpredictable events (e.g., financial crises, pandemics) that cause extreme market disruption.",
    "Cyberattack": "Reports of major cyberattacks, especially on financial institutions or critical infrastructure, undermining confidence.",
    "Economic Slowdown": "Signals of decelerating economic growth that can lead to lower profit forecasts and bearish market moves.",
    "Recession": "Articles warning of potential economic downturns, signaling broader market risks and shifts in investor sentiment.",
    "Recession Fears": "Increased media and analyst focus on economic downturn risks, which can trigger market anxiety.",
    "Inflation": "Rising inflation news that may force tighter monetary policy, adversely affecting asset prices.",
    "Interest Rates": "Changes in interest rates that impact borrowing costs, corporate profits, and investor sentiment.",
    "Federal Reserve": "Actions or statements from the U.S. central bank that drive monetary policy and market expectations.",
    "GDP Growth": "Economic growth indicators that signal expansion or contraction in economic activity, influencing market movements.",
    "Unemployment Rate": "A key labor market metric that affects consumer spending, corporate earnings, and economic outlook.",
    "Consumer Confidence": "Survey data that reflects consumer sentiment, a leading indicator of economic strength or weakness.",
    "Market Correction": "A significant decline (typically 10% or more) in stock prices, often signaling changing investor sentiment.",
    "Market Volatility": "Reports highlighting spikes in market swings, often a precursor to rapid shifts in investor behavior.",
    "Stock Market Rally": "News of rising stock prices that can indicate optimism or a temporary bounce before further declines.",
    "Bullish/Bearish Sentiment": "Trends in investor confidence that indicate either optimism (bullish) or pessimism (bearish) in the market.",
    "Risk Appetite": "Investor willingness to take on risk, which affects asset allocations and market trends.",
    "Stimulus": "News of fiscal or monetary stimulus measures that tend to boost liquidity and investor optimism.",
    "Litigation": "Reports of significant legal challenges or lawsuits that can materially alter a company's financial outlook.",
    "Supply Chain Disruption": "Information about major disruptions in supply chains—like factory shutdowns or logistics issues—that can hurt earnings.",
    "Scandal": "Mentions of corporate fraud or other scandals that typically lead to swift, negative market reactions.",
    "Oil Prices": "Fluctuations in oil prices that impact inflation, corporate costs, and energy sector performance.",
    "Bitcoin": "To track Bitcoin news",
    "Ethereum": "To track Ethereum news",
    "S&P 500": "To track S&P 500 news",
    "NASDAQ": "To track NASDAQ news",
    "China": "China and the US are sort of in a cold war of trade, so keeping an eye on news mentioning China could give us some indicators."
}